#ifndef G_DSP_H__08_12_2025__15_02
#define G_DSP_H__08_12_2025__15_02

#pragma once 

#include "types.h"

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

#ifdef _ADI_COMPILER
	#pragma pack(1)
	//#ifndef __packed
	//	#define __packed /**/
	//#endif
#else

#endif

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

#define SENS_NUM	2

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct SENS
{
	u16 gain;
	u16 st;
	u16 sl;
	u16 sd;
	u16 deadTime;
	u16 threshold;
	u16 freq;
	u16 filtr;
	u16 pack;
	u16 fi_Type;
	u16 fragLen;
	u16 fragEnable;
};



//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct ReqDsp01	// чтение вектора
{
	enum { VERSION = 1 };

	u16 	rw;
	u16		len;				// Длина структуры
	u16		version;			// Версия структуры

	u16 	mode; 
	u16		ax; 
	u16		ay; 
	u16		az; 
	u16		at;
	SENS	sens[SENS_NUM];		// измерительный датчик
	u16		wavesPerRoundCM;
	u16		wavesPerRoundIM;
	u16		fireVoltage;		// Напряжение излучателя (В)

	u16 	crc;  
};

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct RspHdrCM	// 0xAD40
{
	u16 	rw;				//1. ответное слово	
	u32 	mmsecTime;		//2. Время (0.1мс)
	u32		shaftTime;		//4. Время датчика Холла (0.1мс)
	u16		motoCount; 		//6. Счётчик оборотов двигателя (1/6 об)
	u16		headCount;		//7. Счётчик оборотов головки (об)
	u16		ax; 			//8. AX (уе)
	u16		ay; 			//9. AY (уе)
	u16		az; 			//10. AZ (уе)
	u16		at;				//11. AT (short 0.01 гр)
	u16		sensType; 		//12. Тип датчика (0 - измерительный датчик, 1 - опорный датчик)
	u16		angle;			//13. Угол поворота (0.01гр)(ushort)
	u16		maxAmp;			//14. Амплитуда максимум по всей волне (у.е)
	u16		fi_amp;			//15. Амплитуда по первому вступлению (у.е)
	u16		fi_time;		//16. Время по первому вступлению (0.05 мкс)
	u16 	gain; 			//17. КУ
	u16 	st;	 			//18. Шаг оцифровки
	u16 	sl; 			//19. Длина оцифровки (макс 2028)
	u16 	sd; 			//20. Задержка оцифровки  
	u16		packType;		//21. Упаковка (1 - 4:3 по 12 бит, 2 - 2:1 u-Law, 3 - 4:1 ADPCM по 4 бита)
	u16		packLen;		//22. Размер упакованных данных
};							

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct RspHdr41	// 0xAD41
{
	u16 	rw;				//1. ответное слово	
	u32 	mmsecTime;		//2. Время (0.1мс)
	u32		shaftTime;		//4. Время датчика Холла (0.1мс)
	u16		sensType; 		//6. Тип датчика (0 - измерительный датчик, 1 - опорный датчик)
	u16 	gain; 			//7. КУ
	u16 	st;	 			//8. Шаг оцифровки
	u16 	sl; 			//9. Длина оцифровки (макс 2028)
	u16 	sd; 			//10. Задержка оцифровки  
	u16		packType;		//11. Упаковка (1 - 4:3 по 12 бит, 2 - 2:1 u-Law, 3 - 4:1 ADPCM по 4 бита)
	u16		packCount;		//12. Количество передаваемых волновых пакетов N
};							

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct PacketHdr41	
{
	__packed struct
	{
		u16 	deltatime;		//1. Дельта времени относительно Время(2,3) (0.1мс). (В сумме = Время (0.1мс))
		u16 	angle;			//2. Угол поворота (0.01гр)(ushort)
		u16		fi_amp;			//3. Амплитуда по первому вступлению (у.е)
		u16		fi_time; 		//4. Время по первому вступлению (0.05 мкс)
		u16		packLen;		//5. Размер упакованных данных
	}
	hdr;

	u16		data[0]; 		//6.... данные волновой картины 
};

#define MAX_WAVEPACKET_LEN	128
#define MAX_RSP41_LEN		3072

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct Rsp41
{
	RspHdr41 hdr; 
	u16 data[MAX_RSP41_LEN/2]; 
};

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct RspHdrIM	// 0xAD50
{
	u16 	rw;
	u32 	mmsecTime;		//mmsecTime; 
	u32		shaftTime;		//shaftTime; 
	u16		ax; 
	u16		ay; 
	u16		az; 
	u16		at;
	u16 	gain; 
	u16		refAmp;
	u16		refTime;
	u16		dataLen;
};

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed union RspDsp01	// чтение вектора
{
	enum { VERSION = 1 };

	__packed struct { RspHdrCM hdr; u16 data[1024]; } CM;
	__packed struct { RspHdrIM hdr; u16 data[1024]; } IM;
	__packed struct { u16 rw; u16 len; u16 version; u16 fireVoltage; u16 motoVoltage; u16 crc; } v01;
};

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct  ReqDsp05	// запрос контрольной суммы и длины программы во флэш-памяти
{ 
	u16		rw; 
	u16 	crc; 
};  

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct  RspDsp05	// запрос контрольной суммы и длины программы во флэш-памяти
{ 
	u16		rw; 

	__packed union
	{
		__packed struct { u16 flashLen; u16 flashCRC; u16 crc; } v1;
		__packed struct { u16 flashLen; u32 startAdr; u16 flashCRC; u16 crc; } v2;
	};
};  

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct  ReqDsp06	// запись страницы во флэш
{ 
	u16		rw; 
	u16		stAdr; 
	u16		count; 
	byte	data[258]; 
	u16		crc; 
};  

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct  RspDsp06	// запись страницы во флэш
{ 
	u16		rw; 
	u16		res; 
	word	crc; 
};  

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

__packed struct  ReqDsp07	// перезагрузить блэкфин
{ 
	u16		rw; 
	word 	crc; 
};  

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

#ifdef _ADI_COMPILER
#pragma pack()
//#undef __packed
#endif



#endif //G_DSP_H__08_12_2025__15_02
